.text

		# CANO
		# Dimensões: 10 uG x 6 uG(altura x comprimento)
		
main: 	lui $8,0x1001
	ori $9,0x000300		# preto
	ori $10,0x09a603	# verde escuro
	ori $11,0x80d010 	# verde claro

	sw $9,27624($8)
	sw $11,27628($8)
	sw $10,27632($8)	# verde escuro
	sw $11,27636($8)	# corpo linha 1(54)
	sw $11,27640($8)
	sw $11,27644($8)
	
	sw $9,27112($8)
	sw $11,27116($8)
	sw $10,27120($8)	# verde escuro
	sw $11,27124($8)	# corpo linha 2(53)
	sw $11,27128($8)
	sw $11,27132($8)
	
	sw $9,26600($8)
	sw $11,26604($8)
	sw $10,26608($8)	# verde escuro
	sw $11,26612($8)	# corpo linha 3(52)
	sw $11,26616($8)
	sw $11,26620($8)
	
	sw $9,26088($8)
	sw $11,26092($8)
	sw $10,26096($8)	# verde escuro
	sw $11,26100($8)	# corpo linha 4(51)
	sw $11,26104($8)
	sw $11,26108($8)
	
	
	sw $9,25576($8)
	sw $11,25580($8)
	sw $10,25584($8)	# verde escuro
	sw $11,25588($8)	# corpo linha 5(50)
	sw $11,25592($8)
	sw $11,25596($8)
	
	sw $9,25064($8)
	sw $9,25068($8)
	sw $9,25072($8)		# verde escuro
	sw $9,25076($8)		# "PESCOÇO" linha 6(49)
	sw $9,25080($8)
	sw $9,25084($8)
	
	sw $9,24544($8)
	sw $11,24548($8)
	sw $10,24552($8)	# verde escuro
	sw $11,24556($8)	# cabeça linha 1(48)
	sw $11,24560($8)
	sw $11,24564($8)
	sw $11,24568($8)
	sw $11,24572($8)
	
	
	
	sw $9,24032($8)
	sw $11,24036($8)
	sw $10,24040($8)	# verde escuro
	sw $11,24044($8)	# cabeça linha 2(47)
	sw $11,24048($8)
	sw $11,24052($8)
	sw $11,24056($8)
	sw $11,24060($8)
	
	sw $9,23520($8)
	sw $11,23524($8)
	sw $10,23528($8)	# verde escuro
	sw $11,23532($8)	# cabeça linha 3(46)
	sw $11,23536($8)
	sw $11,23540($8)
	sw $11,23544($8)
	sw $11,23548($8)
	
	sw $9,23008($8)
	sw $11,23012($8)
	sw $10,23016($8)	# verde escuro
	sw $11,23020($8)	# cabeça linha 4(45)
	sw $11,23024($8)
	sw $11,23028($8)
	sw $11,23032($8)
	sw $11,23036($8)
	
	sw $9,22496($8)
	sw $9,22500($8)
	sw $9,22504($8)		
	sw $9,22508($8)		# borda superior (44)
	sw $9,22512($8)
	sw $9,22516($8)
	sw $9,22520($8)
	sw $9,22524($8)
	
	
	
	
	
	
	